;Unversal function to print string on screen with windows.
;Authours: ...
;
;Function description and globals.
;
;Parameters:
;
;Returns:
;
;Function comment.
;Platforms: ...
;Assemble: ...
;Code size: ...
;Static data size: ...
;Performance: 
;
;Полное название функции на русском.
;Автор: ...
;
;Описание, подробное функиции, что именно
;она длеает.
;
;Параметры:
;
;Возврат(регистры или память):
;
;Дополнительный комментарий, как функция
;работает и если есть неявные моменты.
;
;Платформы: машины совместимости;
;Ассемблер: чем можно точно собрать;
;Размер кода: если есть возможность;
;Размер статичных данных: для статичности;
;Производительность: быстро! :)
