# Простые программки и примеры на Питоне, для вещаний на канале "Восьмибитное Чаепитие".
# Simple tasks and examples on Python, for streams on '8-Bit Tea Party'.

'''
1 Введение.
2 Переменные, числа и строки.
3 Списки, словари, кортежи и множества.
4 Управляющие конструкции и базовые структуры.
5 Модули и пакеты.
6 Объекты и классы.
7 Строки, форматы и регулярные выражения.
8 Файлы, общие вопросы. И работа с БД.
9 Работа с сетью. Фреймворки.
10 Системные вызовы, процессы, потоки и дата и время.
11 Многопоточность и может сокеты.
12 Дополнительное вещание. Практические рекомендации.
'''

print('Hello World!')
